{
    "description": "The Mutant known as Bishop was born into a bleak alternate future in which the robot Sentinels wiped out most of the X-Men, and Mutants were branded with an “M” over their right eye for identification. After chasing a criminal through a time portal with no means to return to his own timeline, Bishop joined the X-Men.",
    "gameplay": {
        "description": "Persistent Power Meter\n- Bishop’s mastery over energy and time enables him to enter a fight with 100% of the Power he finished his previous fight in the same Quest with.\n- Bishop’s Special Attacks cost no Power when activated. Instead, after the Special ends, Bishop immediately loses however many Bars of Power that special would have cost\nAlways Active – Personal Prowess\n- All of Bishop’s Personal Passive Prowess effects increase Special Attack Damage by 10%.\nAlways Active – Energy Transference\n- +4076.47 Energy Resistance.\n- Every 1 second(s), on receiving any Energy Damage gain 3 Passive Prowess.\n- Absorbing the kinetic energy of Blocking or being Struck generates 1 stack of Prowess, Well Time Blocks gain an additional +6 Prowess.\n- All these abilities grant +2 Prowess vs Skill Opponents, and -1 vs Tech.\nBlocking\n- Holding Block for 0.5 seconds, Bishop converts 1 Personal Prowess into a Regeneration Buff every 0.33 seconds, granting 186.67 Health over 5 seconds. Max Stacks: 5.\n- Each Prowess converted also has an 100% chance to Purify a Bleed Debuff.\nAlways Active – Debuff Feedback\n- Each time the Opponent Purifies a Debuff they instantly receive 1902.57 Energy Damage.\n- Skill Champions also receive a Passive Stun lasting 1.50 second(s) if the Debuff Purified was a Stun.\nWarning: Power Overload!\n- While Bishop has more than 30 Prowess, or if he’s Bleeding, he Overloads and begins consuming his personal Prowess effects 1 at a time, getting faster the longer he’s been Overloading.\n- If Bishop is suffering from a Bleed, Shock, or Incinerate, Debuff or Passive, each time he consumes a Prowess this way he also deals 476 Energy Damage to his Opponent, scaling with Base Attack.\nSpecial Attacks\n- After each Special Attack Bishop consumes all his Personal Prowess Passives.\n- If Bishop is Overloading go Unblockable for the Duration of the Special Attack."
    },
    "specials": {
        "1": {
            "name": "Steady Release",
            "description": "After this Special Attack finishes, gain a Steady Release Passive for 10 seconds.\nWhile active every 0.75 second(s) while near the opponent, inflict an Incinerate Debuff on them, dealing 773.5 Energy Damage over 3 seconds.\nEach Prowess consumed by this attack increases the Duration of Steady Release by 2.5%."
        },
        "2": {
            "name": "Burst Release",
            "description": "The last hit has a 100% chance to inflict an Incinerate Debuff lasting 10 seconds, and dealing 70% of the total damage dealt by this Special."
        },
        "3": {
            "name": "Diffusion Wave",
            "description": "100% chance to inflict a non-stacking Energy Vulnerability reducing Energy Resistance by 1274.04 for 20 seconds.\nAgainst enemies at full Health, this Energy Vulnerability becomes indefinite."
        }
    },
    "signature": {
        "name": "Foresight",
        "description": "Passive\nBishop prepares a unique bonus based on how many bars of Power are full at the start of the fight that last for the remainder of the fight.\n- With 0 Bars: Special Attacks become Unblockable with a stack of 10 or more Prowess.\n- With 1 Bar: While Blocking, gain Stun Immunity and enemies lose 80% ability accuracy.\n- With 2 Bars: Special Attacks have a 100% chance to leave the target Incinerated for 70% of the Special damage over 10 seconds.\n- With 3 Bars: Start the fight with Steady Release active for 15 seconds."
    },
    "author": {
        "name": "Kabam",
        "type": "spotlight",
        "profile": "https://playcontestofchampions.com/champion-spotlight-bishop/"
    }
}
