{
    "description": "A master of manipulation and overall evil genius, Ebony Maw is Thanos’s most trusted lieutenant, never failing him even once. Focusing on his strong telekinetic abilities rather than raw physical strength, Ebony Maw curves and bends the environment around him with ease. Additionally, his superhumanly persuasive voice allows him to sway even the strongest minds.",
    "gameplay": {
        "description": "ALWAYS ACTIVE:\n- Ebony Maw’s first Light Attack is the only Basic hit to make contact with the Opponent.\n- If the Opponent doesn’t have Class Advantage, Ebony Maw causes all guaranteed Critical Hits to Miss.\nMISSIONS FROM THANOS:\n- Ebony Maw has 3 missions to complete. Each mission can only be completed once per fight and when successful will inflict a Passive Degeneration, dealing 7580.8 Direct Damage over 4 seconds, this scales with Base Attack only.\n- Mission 1 - Mastermind: Nullify a Buff from the Opponent.\n- Mission 2 - Manipulator: Inflict a Power Steal effect.\n- Mission 3 - Unwavering: Cause the Opponent to Miss.\n- Completing all 3 missions in a single fight grants 1 Persistent Charge, each increasing the duration of Degeneration effects by 10% and reducing the potency of the Opponent's Fury effects by 25% for the rest of the quest. Persistent Charges stack up to a max of 4.\nPERSUASIVE VOICE:\n- Become Focused after 7 seconds, this time is doubled while suffering from a non-damaging Debuff. While Ebony Maw is Focusing, the Opponent’s Ability Power Rate is reduced by 60%.\n- If knocked down by a Heavy Attack or Special Attack 3, Focus is broken and re-focusing begins after 1 second(s). Once Focused, the Opponent gains 1 Persuasion every 0.60 seconds.\n- Every 20th Persuasion the Opponent gains will inflict a Falter Debuff for 3 seconds, giving them a 100% chance to Miss. This duration is increased to 4 seconds against Cosmic Opponents.\n- At 100 Persuasion the Opponent is inflicted with Black Tongue for the rest of the fight, reducing Power Gained from all sources by 40% and increasing Ebony Maw’s Attack Rating by +947.6.\n- When Black Tongue is active, inflict the above Falter Debuff every 15 seconds."
    },
    "attack": {
        "heavy": "Landing a Heavy Attack steals all the Opponent’s Power gain Buffs and 10% of their current Power."
    },
    "specials": {
        "1": {
            "name": "Unseen Blades",
            "description": "When activated and with each hit, Ebony Maw Nullifies 1 Fury, Cruelty, or Precision Buff from the Opponent. This expands to all Buffs if the Opponent is inflicted with Black Tongue.\nIf no Buffs were Nullified during this Attack, the Opponent gains a Fury Buff increasing their Attack Rating by 0 for 10 seconds."
        },
        "2": {
            "name": "Environmental Manipulation",
            "description": "Each hit inflicts a Passive Degeneration, dealing 3056.01 Direct Damage over 4 seconds. If the Opponent is suffering from a Falter effect, each hit inflicts 2 additional Degenerations.\nThe final hit refreshes any active Falter Debuffs."
        },
        "3": {
            "name": "Microsurgery Paralysis",
            "description": "This Attack grants no Power to the Opponent.\nSteal 100% of the Opponent’s Power and gain a Power Gain Buff, granting 40% of the Power stolen over 5 seconds."
        }
    },
    "signature": {
        "description": "When the Opponent Misses an Attack they are inflicted with a Passive Degeneration, dealing 947.61 Direct Damage over 1 seconds.\nWhile the Opponent is suffering from a Falter Debuff their Auto-Block Ability Accuracy is reduced by 100% and Ebony Maw gains +40% Ability Power Rate.",
        "name": "Deteriorating Mind"
    },
    "author": {
        "name": "Kabam",
        "type": "spotlight",
        "profile": "https://forums.playcontestofchampions.com/en/discussion/266404/champion-spotlight-ebony-maw"
    }
}
