{
    "author": {
        "type": "spotlight",
        "profile": "https://playcontestofchampions.com/champion-spotlight-howard-the-duck/",
        "name": "Kabam"
    },
    "gameplay": {
        "description": "Always Active\nThe Bulky ISO-Loader suit provides Immunity to Bleed effects.\nHoward’s personal Buffs and Debuffs each expire 1 at a time.\n\nButton Masher Extraordinaire\nRapidly pressing the Block button at different times in the fight grants Howard special MASH! Bonuses. Each MASH! bonus requires more presses of the Block button than the last within the same window.\nIn the Pre-Fight Menu, Howard can activate the Auto-Masher which lasts for the duration of the fight. While Auto-Masher is active, all MASH! Bonuses will be handled automatically for Howard.\nWhile fighting as a Defender, Auto-Masher is always active.\n\nBefore the Fight Starts\nGain 1 indefinite Dormant Armor. MASH! Gain additional Dormant Armors. When the fight starts each Dormant Armor is converted into an indefinite Armor Up Buff, increasing Armor Rating by +259.55.\n\nWhile Either Champion is Stunned\n100% chance to gain a Fury Buff, increasing Attack Rating by +235.8 for 10 seconds. Max Stacks: 50. MASH! Gain additional Fury Buffs.\n\nHeavy Attacks\n100% chance to inflict an Armor Break Debuff, removing an Armor Up Buff and reducing Armor Rating by 76.17 for 5 seconds. Max Stacks: 10. MASH! Additional hits can inflict additional Armor Break Debuffs."
    },
    "specials": {
        "1": {
            "description": "100% chance to inflict 2 Heal Block Debuffs, each lasting 2.50 seconds. MASH! Inflict additional Heal Block Debuffs."
        },
        "2": {
            "description": "80% chance to inflict a Suppression Debuff, reducing Combat Power Rate by 10% for 4 seconds. MASH! Additional hits can inflict additional Suppression Debuffs."
        },
        "3": {
            "description": "100% chance to inflict a 3 second Stun Debuff.\nIf Howard gets a Perfect result in the Special 3 Mini Game, this Stun Debuff becomes a Passive and lasts 4 seconds."
        }
    },
    "signature": {
        "description": "Always Active:\nIf Howard is fighting in any fight with a Class Advantage, he breaks out his legendary Quack-Fu to gain the following:\nCritical Resistance equal to 40% of Howard’s Armor Rating.\nBase Ability Accuracy of 115% instead of the normal 100%\nIncoming Debuffs suffer -1.3 second(s) duration.",
        "name": "Mash ALL the Buttons!"
    },
    "description": "When Howard was whisked away from his detective agency in New York City to the Battlerealm, he didn’t know what to expect. He certainly didn’t expect to be shoved into some back warehouse, organizing the Collector’s Crystals all day. Well, an insult like this won’t just run off this duck’s back. He’s “borrowed” a spare ISO-Loader, made some upgrades, and attached an old friend; his famous Big Freaking Gun. It’s time for Howard to introduce these so-called Champions to the ultimate fighting style of his home universe, Quack-Fu!"
}
