{
    "description": "Chieftain of the long missing Jabari tribe of Wakanda, Onnange and her tribe have been in hiding following the events between T’Challa and Maestro as they mourn their king. A master huntress who enjoys nothing more than a good fight, she dresses in Jabari armor specifically to earn the favor of Ghekre, the gorilla god, in combat. When not on the hunt, she is a fun and friendly companion, but get on her bad side and you’ll quickly find yourself on the end of her spear.",
    "gameplay": {
        "description": "All Attacks\nGain a non-stacking Cleanse Passive for 2 second(s). When a Champion with Cleanse is inflicted with a Debuff, it is immediately Purified and Cleanse is removed.\nWhile fighting as a Defender, if Jabari Panther Purifies a Stun Debuff, this ability goes on cooldown for 8 second(s).\n\nCritical Hits\nInflict a Bleed Debuff, dealing 1584.05 Direct Damage over 7 second(s).\n\nThe Huntress\nA skilled huntress, Jabari Panther stalks her Opponents no matter where they run or hide. Gain 1 Huntress Charge(s) when Attacking a Stunned or Ensnared Opponent.\nGain 3 Huntress Charge(s) whenever Jabari Panther Purifies a Debuff, and when the Opponent Evades or causes an Attack to Miss. When fighting as an Attacker, this only triggers while Jabari Panther has 5 or fewer Charges.\nAfter gaining any Charges, no more can be gained for 1.25 second(s).\nLose 2 Huntress Charge(s) whenever the Opponent gains a Prowess Buff or Passive.\n\nThe Hunt\nOnce Jabari Panther has at least 10 Huntress Charges, remove them and Hunt the Opponent for 9 second(s). Huntress Charges cannot be gained while Hunting.\nWhile the Hunt is on, Jabari Panther is Stun Immune and gains a Precision Buff, increasing Critical Rating by +8400.\nAdditionally, the Opponent cannot trigger the Dexterity mastery, Evade, or cause Attacks to Miss.\nWhenever Jabari Panther Purifies a Debuff, or the Opponent fails a Miss or Evade, Pause the Hunt and all Fury Buffs on Jabari Panther for 2 second(s).\nInflicting a Bleed Debuff Pauses all Bleed Debuffs on the Opponent for 0.50 second(s).\n\nSpecial Attacks\nActivating any Special Attack and the Hunt within 1 second(s) of each other grants a non-stacking Fury Buff, increasing Attack Rating by +3899.2 for 9 second(s)."
    },
    "attack": {
        "heavy": "If the Hunt is active, each Bleed Debuff on the Opponent has a 50% chance to inflict another Bleed Debuff, dealing 1827.75 Direct Damage over 7 second(s). This ends the Hunt."
    },
    "specials": {
        "1": {
            "description": "On activation, inflict an Ensnare Debuff on the Opponent for 11 second(s). Ensnared Champions suffer -30% Ability Accuracy and cannot Evade."
        },
        "2": {
            "description": "The Hunt is Paused during this Attack."
        },
        "3": {
            "description": "The next time the Hunt activates, the Opponent is also Stunned for 4.50 second(s).\nGain 3 permanent Huntress charge(s) that are not removed when the Hunt triggers. Max 6."
        }
    },
    "signature": {
        "name": "Chosen of Ghekre",
        "description": "Passive\nThe duration of the Hunt is increased by 3 second(s).\nWhenever Jabari Panther would gain a Huntress Charge while the Hunt is active, she instead gains an indefinite Counterpunch Charge. Max Charges starts at 1, and increases by 1 for every 50 signature levels obtained.\nA Counterpunch Charge is spent to gain Unstoppable for 0.75 second(s) when Blocking an Attack, and all are lost when the Hunt ends."
    },
    "author": {
        "name": "Kabam",
        "type": "spotlight",
        "profile": "https://playcontestofchampions.com/champion-spotlight-jabari-panther/"
    }
}
