{
    "description": "Deadpool once visited a church in Mexico, stopping to give confession. The priest who took his confession was convinced by it that the world needed to be punished, becoming the mercenary Masacre. Extracting information from the reluctant Inspector Jaime Gordón, Masacre tracks down and takes out the crime lord Calavera de Jade. The very next day Masacre rides off to New York, joining Deadpool’s Mercs for Money.",
    "gameplay": {
        "description": "Failed Incinerate Effects\nEach time an Incinerate effect fails to apply due to an Immunity, the target instead takes a burst of 1591.65 Energy Damage.\n\nBaseball Bat Attacks\nFirst, second and third Light Attack, as well as the first Medium and Heavy attack utilize the Baseball Bat.\n\nBaseball Bat Attacks – While Building Ignition Charges\n+700 Block Penetration.\nLanding a Critical Hit, being Blocked, or striking an opponent that has an Incinerate Debuff grants 1 Ignition Charge for 20 seconds.\nCritical Hits deal an additional {10}% of damage dealt as a burst of Energy Damage for each Ignition Charge.\nWhile Ignited, Masacre cannot gain Ignition Charges.\nUpon reaching 10 Ignition Charges, all Charges are consumed and Mascare’s Bat becomes Ignited for 20 seconds.\n\nBaseball Bat Attacks – While Ignited\n+1400 Block Penetration.\nGain Power when striking a Block as if landing a Hit.\n100% chance to inflict an Incinerate Debuff, causing 1591.65 Energy Damage over 5 seconds, removing Perfect Block Chance and reducing Block Proficiency by 50%.\nThese Incinerate Debuffs gain +1 second duration for each Incinerate on the opponent. Max: +5 Seconds.\n\nWhen Blocked\nOpponent suffers -50% Ability Accuracy if they have at least 1 Debuff."
    },
    "attack": {
        "heavy": "Each bat hit against an Incinerated Opponent, grants an additional Ignition Charge."
    },
    "specials": {
        "1": {
            "description": "100% chance to inflict a Disorient Debuff lasting 12 seconds and reducing Defensive Ability Accuracy and Block Proficiency by 50%. +200% Duration if the opponent doesn’t have an Incinerate Debuff.\n100% chance to refresh all active Incinerate Debuffs on the opponent.\nMachete Hits have a 100% chance to inflict a Bleed Debuff, causing 1768.5 direct damage over 20 seconds."
        },
        "2": {
            "description": "+1400 Block Penetration if Ignited\n+31540.61 Attack Rating if Blocked.\nIf Masacre strikes into a Block, he will avoid incoming attacks for 1.0 second granting them a 100% chance to Miss."
        },
        "3": {
            "description": "100% chance to inflict an Incinerate Debuff, causing 7074 Energy Damage over 5 seconds, removing Perfect Block Chance and reducing Block Proficiency by 50%."
        }
    },
    "signature": {
        "name": "Enthusiastic Punishment",
        "description": "All Attacks – If Opponent has 0 Incinerate Debuffs\nMascare’s fervor for the job grants him the following:\n+30.02% Combat Power Rate while attacking.\n+2019.64 Critical Rating."
    },
    "author": {
        "name": "Kabam",
        "type": "spotlight",
        "profile": "https://playcontestofchampions.com/champion-spotlight-masacre/"
    },
    "youtube": "33Pnfq0VDIQ"
}